// Enhanced LLVM IR to TOSA IR Conversion
// Generated by Complete LLVM2TOSA Converter with High-level Pattern Recognition
// Supports all 68 LLVM instructions -> 66 TOSA operations

module {
  func.func @matrix_vector_add_broadcast(%A: tensor<2x3xi32>, %B: tensor<3xi32>) -> tensor<2x3xi32> {
    // Matrix-vector broadcast addition
    %C = tosa.add %A, %B : (tensor<2x3xi32>, tensor<3xi32>) -> tensor<2x3xi32>
    return %C : tensor<2x3xi32>
  }
}