// LLVM IR to TOSA IR Conversion
// Generated by Complete LLVM2TOSA Converter
// Supports all 68 LLVM instructions -> 66 TOSA operations

module {
func.func @simple_add() -> () {
  // Basic block: entry
  %result = tosa.add scalar_0, scalar_1 : (tensor<1xi32>, tensor<1xi32>) -> tensor<1xi32>
  result_2 = tosa.add scalar_3, %result : (tensor<1xi32>, tensor<1xi32>) -> tensor<1xi32>
}

}
