// LLVM IR to TOSA IR Conversion
// Generated by Complete LLVM2TOSA Converter
// Supports all 68 LLVM instructions -> 66 TOSA operations

module {
func.func @simple_matrix_add(%A: tensor<2x3xi32>, %B: tensor<3xi32>) -> tensor<2x3xi32> {
    // Matrix-vector broadcast addition
    %B_result = tosa.add %A, %B : (tensor<2x3xi32>, tensor<3xi32>) -> tensor<2x3xi32>
    return %B_result : tensor<2x3xi32>
  }

}
